Autodesk.Revit.DB.TextNode.GetFormattedTextRuns
Returns a list of separated runs of formatted text.
Remarks:
This method is obsolete and may return an empty array for certain nodes. Use Autodesk.Revit.DB.TextNode.GetFormattedText instead.
Returns:
A collection of instances of Autodesk.Revit.DB.FormattedTextRun.
Since:
2016

Autodesk.Revit.DB.TextNode.IsForRightToLeftReading
Indicates whether the text uses Right-To-Left reading order.
Since:
2016

Autodesk.Revit.DB.TextNode.TextSize
Height [ft] of the text in model space.
Remarks:
The value specifies the height of the text excluding both the ascender and descender.
It is approximately the height of capital letters in the font.
Since:
2016